const shuttleRoutes = [
    {
        routeCode: "SUCCESS",
        routeName: "成功線",
        color: "GREEN",

        outbound: [
            "成功嶺文虎台",
            "三號門",
            "學田路",
            "高鐵陸橋",
            "高鐵一路",
            "環河路五段",
            "長壽路",
            "振興街",
            "成功火車站接駁區（車站作業區）"
        ],

        inbound: [
            "成功火車站接駁區（車站作業區）",
            "振興街",
            "長壽路",
            "環河路五段",
            "高鐵一路",
            "高鐵陸橋",
            "學田路",
            "三號門",
            "成功嶺文虎台"
        ]
    },

    {
        routeCode: "XINWURI",
        routeName: "新烏日線",
        color: "BLUE",

        outbound: [
            "成功嶺文虎台",
            "三號門",
            "學田路",
            "高鐵路二段",
            "高鐵二路",
            "中山路三段",
            "高鐵六路",
            "新烏日火車站接駁區（統聯總站）"
        ],

        inbound: [
            "新烏日火車站接駁區（統聯總站）",
            "高鐵六路",
            "中山路三段",
            "高鐵二路",
            "高鐵路二段",
            "學田路",
            "三號門",
            "成功嶺文虎台"
        ]
    },

    {
        routeCode: "SHUINAN",
        routeName: "水湳經貿線",
        color: "YELLOW",

        outbound: [
            "成功嶺虎威台",
            "四號門",
            "同安西巷",
            "台貿路",
            "永春南路",
            "永春路",
            "74快",
            "環中路二段",
            "經貿路二段",
            "經貿六停車場接駁區",
            "經貿路二段",
            "經貿七路",
            "中科路",
            "環中路二段",
            "經貿路二段",
            "經貿九路",
            "水湳轉運站接駁區"
        ],

        inbound: [
            "水湳轉運站接駁區",
            "環中路二段",
            "經貿路二段",
            "黎明路三段",
            "凱旋路",
            "環中路二段",
            "74快",
            "永春路",
            "永春南路",
            "台貿路",
            "同安西巷",
            "四號門",
            "成功嶺虎威台"
        ]
    }
];

module.exports = shuttleRoutes;